saitez/Cypress_wifi_ble-psoc62-/tez_bmi160_defs.h
/* C  standard libraries
 written by saitez, using Cypress PSOC6 WIFI-BT 
usage : PEDOMETER , etc */
 
#include <stdint.h>
#include <stddef.h>

/* Conditional statement  */ 
#ifndef TEZ_BMI160_DEFS_H
#define TEZ_BMI160_DEFS_H 

/* Common macros*/

if !defined(UINT8_C) && !defined(INT8_C)
#define INT8_C(x)    S8_C(x)
#define UINT8_C(x)   U8_C(x)
#endif 

if !defined(UINT16_C) && !defined(INT16_C)
#define INT16_C(x)    S16_C(x)
#define UINT16_C(x)   U16_C(x)
#endif  

if !defined(UINT32_C) && !defined(INT32_C)
#define INT32_C(x)    S32_C(x)
#define UINT32_C(x)   U32_C(x)
#endif 

if !defined(UINT64_C) && !defined(INT64_C)
#define INT64_C(x)    S64_C(x)
#define UINT64_C(x)   U64_C(x)
#endif 

/* C standard Macros*/

#ifndef NULL
#ifdef __cplusplus
#define NULL 0
#else
#define NULL ((void *) 0)
#endif
#endif

/*Sensor Macros ............. endian*/

#ifndef __ORDER_LITTLE_ENDIAN__
#define __ORDER_LITTLE_ENDIAN__ 0
#endif

#ifndef __BYTE_ORDER__
#define __BYTE_ORDER__
#endif

#if __BYTE_ORDER__ == __ORDER_LITTLE_ENDIAN__
#ifndef LITTLE_ENDIAN
#define LITTLE_ENDIAN
#endif

#elif __BYTE_ORDER__ == __ORDER_BIG_ENDIAN__
#ifndef BIG_ENDIAN
#define BIG_ENDIANS
#endif
#else
#error "code does not support ENDIAN format of the processor"
#endif

/**
Masking is the process or operation to set bit on to off or off to on in a byte,nibble or word. Mask means to block. Masking is the process by which ,only required data is retained and the rest is masked (blocked) Masking can be done using Bitwise Operators. Most Commonly Used Bitwise Operator is AND(&) , OR(|)

**/

/** MASK definitions**/

#define BMI160_ACCEL_BW_MASK               UINT8_C(0x70)   //0111 0000
#define BMI160_ACCEL_ODR_MASK              UINT8_C(0x0F)   //0000 1111            
#define BMI160_ACCEL_UNDERSAMPLING_MASK    UINT8_C(0x80)   //1000 0000
#define BMI160_ACCEL_RANGE_MASK            UINT8_C(0x0F)   //0000 1111
#define BMI160_GYRO_BW_MASK                UINT8_C(0x30)   //0011 0000
#define BMI160_GYRO_ODR_MASK               UINT8_C(0x0F)   //0000 1111
#define BMI160_GYRO_RANGE_MASK             UINT8_C(0x07)   //0000 0111 
 




/*Interrupt Enable Registers INT_EN*/

#define BMI160_ANY_MOTION_X_INT_EN_MASK     UINT8_C(0x01)      // 0000 0001
#define BMI160_HIGH_G_X_INT_EN_MASK         UINT8_C(0x01)      // 0000 0001
#define BMI160_NO_MOTION_X_INT_EN_MASK      UINT8_C(0x01)      // 0000 0001

#define BMI160_ANY_MOTION_Y_INT_EN_MASK     UINT8_C(0x02)      // 0000 0010
#define BMI160_HIGH_G_Y_INT_EN_MASK         UINT8_C(0x02)      // 0000 0010
#define BMI160_NO_MOTION_Y_INT_EN_MASK      UINT8_C(0x02)      // 0000 0010

#define BMI160_ANY_MOTION_Z_INT_EN_MASK     UINT8_C(0x04)      // 0000 0100
#define BMI160_HIGH_G_Z_INT_EN_MASK         UINT8_C(0x04)      // 0000 0100
#define BMI160_NO_MOTION_Z_INT_EN_MASK      UINT8_C(0x04)      // 0000 0100


#define BMI160_SIG_MOTION_INT_EN_MASK       UINT8_C(0x07)      // 0000 0111
#define BMI160_ANY_MOTION_ALL_INT_EN_MASK   UINT8_C(0x07)      // 0000 0111
#define BMI160_STEP_DETECT_INT_EN_MASK      UINT8_C(0x08)      // 0000 1000              
#define BMI160_DOUBLE_TAP_INT_EN_MASK       UINT8_C(0x10)      // 0001 0000
#define BMI160_SINGLE_TAP_INT_EN_MASK       UINT8_C(0x20)      // 0010 0000
#define BMI160_FIFO_FULL_INT_EN_MASK        UINT8_C(0x20)      // 0010 0000
#define BMI160_ORIENT_INT_EN_MASK           UINT8_C(0x40)      // 0100 0000
#define BMI160_FIFO_WATERMARK_INT_EN_MASK   UINT8_C(0x40)      // 0100 0000
#define BMI160_LOW_G_INT_EN_MASK            UINT8_C(0x08)      // 0000 1000
#define BMI160_FLAT_INT_EN_MASK             UINT8_C(0x80)      // 1000 0000
#define BMI160_DATA_RDY_INT_EN_MASK         UINT8_C(0x10)      // 0001 0000



/*POWER MANAGEMENT UNIT(PMU) STATUS */

#define BMI160_AUX_PMU_SUSPEND	     UINT8_C(0x00)                                 //AUX ~ MAGNETOMETER              
#define BMI160_AUX_PMU_NORMAL        UINT8_C(0x01)
#define BMI160_AUX_PMU_LOW_POWER     UINT8_C(0x02)


#define BMI160_GYRO_PMU_SUSPEND      UINT8_C(0x00)
#define BMI160_GYRO_PMU_NORMAL       UINT8_C(0x01)
#define BMI160_GYRO_PMU_FSU          UINT8_C(0x03)


#define BMI160_ACCEL_PMU_SUSPEND       UINT8_C(0x00)
#define BMI160_ACCEL_PMU_NORMAL        UINT8_C(0x01)
#define BMI160_ACCEL_PMU_LOW_POWER     UINT8_C(0x02)


/*MASK definitions for INT_OUT_CTRL Register*/


#define BMI160_INT1_EDGE_CTRL_MASK      UINT8_C(0x01)
#define BMI160_INT1_OUTPUT_MODE_MASK    UINT8_C(0x04)     // IDK
#define BMI160_INT1_OUTPUT_TYPE_MASK    UINT8_C(0x02)      // IDK
#define BMI160_INT1_OUTPUT_EN_MASK      UINT8_C(0x08)
#define BMI160_INT2_EDGE_CTRL_MASK      UINT8_C(0x10)
#define BMI160_INT2_OUTPUT_MODE_MASK    UINT8_C(0x40)       // IDK
#define BMI160_INT2_OUTPUT_TYPE_MASK    UINT8_C(0x20)        // IDK
#define BMI160_INT2_OUTPUT_EN_MASK      UINT8_C(0x80)



/** Mask definitions for INT_LATCH register */
#define BMI160_INT1_INPUT_EN_MASK            UINT8_C(0x10)
#define BMI160_INT2_INPUT_EN_MASK            UINT8_C(0x20)
#define BMI160_INT_LATCH_MASK                UINT8_C(0x0F)




/* Mask definitions for INT_MAP register */

#define BMI160_INT1_LOW_G_MASK                    UINT8_C(0x01)
#define BMI160_INT1_HIGH_G_MASK                   UINT8_C(0x02)
#define BMI160_INT1_SLOPE_MASK                    UINT8_C(0x04)   //IDK
#define BMI160_INT1_NO_MOTION_MASK                UINT8_C(0x08)
#define BMI160_INT1_DOUBLE_TAP_MASK               UINT8_C(0x10)
#define BMI160_INT1_SINGLE_TAP_MASK               UINT8_C(0x20)
#define BMI160_INT1_FIFO_FULL_MASK                UINT8_C(0x20)
#define BMI160_INT1_FIFO_WM_MASK                  UINT8_C(0x40)
#define BMI160_INT1_ORIENT_MASK                   UINT8_C(0x40)
#define BMI160_INT1_FLAT_MASK                     UINT8_C(0x80)
#define BMI160_INT1_DATA_READY_MASK               UINT8_C(0x80)

#define BMI160_INT2_LOW_G_MASK                    UINT8_C(0x01)
#define BMI160_INT2_HIGH_G_MASK                   UINT8_C(0x02)
#define BMI160_INT2_FIFO_FULL_MASK                UINT8_C(0x02)
#define BMI160_INT2_FIFO_WM_MASK                  UINT8_C(0x40)
#define BMI160_INT2_SLOPE_MASK                    UINT8_C(0x04)
#define BMI160_INT2_DATA_READY_MASK               UINT8_C(0x80)
#define BMI160_INT2_NO_MOTION_MASK                UINT8_C(0x08)
#define BMI160_INT2_DOUBLE_TAP_MASK               UINT8_C(0x10)
#define BMI160_INT2_SINGLE_TAP_MASK               UINT8_C(0x20)
#define BMI160_INT2_ORIENT_MASK                   UINT8_C(0x40)
#define BMI160_INT2_FLAT_MASK                     UINT8_C(0x80)


/* Mask definitions for INT_DATA register */

#define BMI160_TAP_SRC_INT_MASK                   UINT8_C(0x08)
#define BMI160_LOW_HIGH_RC_INT_MASK               UINT8_C(0x80)
#define BMI160_MOTION_SRC_INT_MASK                UINT8_C(0x80)

  
/* Mask definitions for INT_MOTION register */

#define BMI160_SLOPE_INT_DUR_MASK                 UINT8_C(0x03)
#define BMI160_NO_MOTION_INT_DUR_MASK             UINT8_C(0xFC)
#define BMI160_NO_MOTION_SEL_BIT_MASK             UINT8_C(0x01)



/* Mask definitions for INT_TAP register */

