saitez/Cypress_wifi_ble-psoc62-/tez_bmi160_defs.h
/** FIFO_CONFIG Definitions */


#define BMI160_FIFO_TIME_ENABLE                 UINT8_C(0x02)
#define BMI160_FIFO_TAG_INT2_ENABLE             UINT8_C(0x04)
#define BMI160_FIFO_TAG_INT1_ENABLE             UINT8_C(0x08)
#define BMI160_FIFO_HEAD_ENABLE                 UINT8_C(0x10)
#define BMI160_FIFO_M_ENABLE                    UINT8_C(0X20)
#define BMI160_FIFO_A_ENABLE                    UINT8_C(0x40)
#define BMI160_FIFO_M_A_ENABLE                  UINT8_C(0x60)
#define BMI160_FIFO_G_ENABLE                    UINT8_C(0x80)
#define BMI160_FIFO_M_G_ENABLE                  UINT8_C(0xA0)
#define BMI160_FIFO_G_A_ENABLE                  UINT8_C(0xC0)
#define BMI160_FIFO_M_G_A_ENABLE                UINT8_C(0xE0)

/* Macro to specify the number of bytes over-read from the
* FIFO in order to get the sensor time at the end of FIFO */

#ifndef BMI160_FIFO_BYTES_OVERREAD
#define BMI160_FIFO_BYTES_OVERREAD           UINT8_C(25)
#endif

/* Accel, gyro and aux. sensor length and also their combined
 * length definitions in FIFO */
#define BMI160_FIFO_G_LENGTH                 UINT8_C(6)
#define BMI160_FIFO_A_LENGTH                 UINT8_C(6)
#define BMI160_FIFO_M_LENGTH                 UINT8_C(8)
#define BMI160_FIFO_GA_LENGTH                UINT8_C(12)
#define BMI160_FIFO_MA_LENGTH                UINT8_C(14)
#define BMI160_FIFO_MG_LENGTH                UINT8_C(14)
#define BMI160_FIFO_MGA_LENGTH               UINT8_C(20)

/** FIFO Header Data definitions */
#define BMI160_FIFO_HEAD_SKIP_FRAME          UINT8_C(0x40)
#define BMI160_FIFO_HEAD_SENSOR_TIME         UINT8_C(0x44)
#define BMI160_FIFO_HEAD_INPUT_CONFIG        UINT8_C(0x48)
#define BMI160_FIFO_HEAD_OVER_READ           UINT8_C(0x80)
#define BMI160_FIFO_HEAD_A                   UINT8_C(0x84)
#define BMI160_FIFO_HEAD_G                   UINT8_C(0x88)
#define BMI160_FIFO_HEAD_G_A                 UINT8_C(0x8C)
#define BMI160_FIFO_HEAD_M                   UINT8_C(0x90)
#define BMI160_FIFO_HEAD_M_A                 UINT8_C(0x94)
#define BMI160_FIFO_HEAD_M_G                 UINT8_C(0x98)
#define BMI160_FIFO_HEAD_M_G_A               UINT8_C(0x9C)

/** FIFO sensor time length definitions */
#define BMI160_SENSOR_TIME_LENGTH            UINT8_C(3)


/** FIFO DOWN selection */

/** ACCEL FIFO DOWNS **/
#define BMI160_ACCEL_FIFO_DOWN_ZERO                  UINT8_C(0x00)
#define BMI160_ACCEL_FIFO_DOWN_ONE                   UINT8_C(0x10)
#define BMI160_ACCEL_FIFO_DOWN_TWO                   UINT8_C(0x20)
#define BMI160_ACCEL_FIFO_DOWN_THREE                 UINT8_C(0x30)
#define BMI160_ACCEL_FIFO_DOWN_FOUR                  UINT8_C(0x40)
#define BMI160_ACCEL_FIFO_DOWN_FIVE                  UINT8_C(0x50)
#define BMI160_ACCEL_FIFO_DOWN_SIX                   UINT8_C(0x60)
#define BMI160_ACCEL_FIFO_DOWN_SEVEN                 UINT8_C(0x70)


/** GYRO FIFO DOWNS **/

#define BMI160_GYRO_FIFO_DOWN_ZERO                  UINT8_C(0x00)
#define BMI160_GYRO_FIFO_DOWN_ONE                   UINT8_C(0x01)
#define BMI160_GYRO_FIFO_DOWN_TWO                   UINT8_C(0x02)
#define BMI160_GYRO_FIFO_DOWN_THREE                 UINT8_C(0x03)
#define BMI160_GYRO_FIFO_DOWN_FOUR                  UINT8_C(0x04)
#define BMI160_GYRO_FIFO_DOWN_FIVE                  UINT8_C(0x05)
#define BMI160_GYRO_FIFO_DOWN_SIX                   UINT8_C(0x06)
#define BMI160_GYRO_FIFO_DOWN_SEVEN                 UINT8_C(0x07)


/** ACCEL FIFO FILTER **/

#define BMI160_ACCEL_FIFO_FIL_EN                     UINT8_C(0x80)

/** GYRO FIFO FILTER **/

#define BMI160_GYRO_FIFO_FIL_EN                      UINT8_C(0x08)

/** Definitions to check validity of FIFO frames */

#define BMI160_FIFO_CONFIG_MSB_CHECK                   UINT8_C(0x80)
#define BMI160_FIFO_CONFIG_LSB_CHECK                   UINT8_C(0x00)

/*! BMI160 accel FOC configurations */

#define BMI160_FOC_ACCEL_DISABLED                      UINT8_C(0x00)
#define BMI160_FOC_ACCEL_POSITIVE_G                    UINT8_C(0x01)
#define BMI160_FOC_ACCEL_NEGATIVE_G                    UINT8_C(0x02)
#define BMI160_FOC_ACCEL_ZERO_G                        UINT8_C(0x03)

/** Array Parameter DefinItions */

#define BMI160_SENSOR_TIME_LSB_BYTE          UINT8_C(0)
#define BMI160_SENSOR_TIME_XLSB_BYTE         UINT8_C(1)
#define BMI160_SENSOR_TIME_MSB_BYTE          UINT8_C(2)


/** Interface settings */

#define BMI160_SPI_INTF                       UINT8_C(1)
#define BMI160_I2C_INTF                       UINT8_C(0)
#define BMI160_SPI_RD_MASK                    UINT8_C(0x80)
#define BMI160_SPI_WR_MASK                    UINT8_C(0x7F)


/* Sensor & time select definition*/
#define BMI160_ACCEL_SEL                     UINT8_C(0x01)
#define BMI160_GYRO_SEL                      UINT8_C(0x02)
#define BMI160_TIME_SEL                      UINT8_C(0x04)

/* Sensor select mask*/

#define BMI160_SEN_SEL_MASK                  UINT8_C(0x07)


/* Error code mask */

#define BMI160_ERR_REG_MASK                  UINT8_C(0x0F)


/* BMI160 I2C ADDRESS */

#define BMI160_I2C_ADDR                       UINT8_C(0x68)

/* BMI160 secondary IF address */
#define BMI160_AUX_BMM150_I2C_ADDR           UINT8_C(0x10)


/** BMI160 Length definitions */
#define BMI160_ONE                           UINT8_C(1)
#define BMI160_TWO                           UINT8_C(2)
#define BMI160_THREE                         UINT8_C(3)
#define BMI160_FOUR                          UINT8_C(4)
#define BMI160_FIVE                          UINT8_C(5)


/** BMI160 fifo level Margin */
#define BMI160_FIFO_LEVEL_MARGIN             UINT8_C(16)

/** BMI160 fifo flush Command */

#define BMI160_FIFO_FLUSH_VALUE             UINT8_C(0xB0)

/** BMI160 offset values for xyz axes of accel */

#define BMI160_ACCEL_MIN_OFFSET                  UINT8_C(-128)
#define BMI160_ACCEL_MAX_OFFSET                  UINT8_C(127)

#define BMI160_GYRO_MIN_OFFSET                   UINT8_C(-512)
#define BMI160_GYRO_MAX_OFFSET                   UINT8_C(511)


/** BMI160 fifo full interrupt position and mask */

#define BMI160_FIFO_FULL_INT_POS                 UINT8_C(5)
#define BMI160_FIFO_FULL_INT_MASK                UINT8_C(0x20)
#define BMI160_FIFO_WTM_INT_POS                  UINT8_C(6)
#define BMI160_FIFO_WTM_INT_MASK                 UINT8_C(0x40)

#define BMI160_FIFO_FULL_INT_PIN1_POS           UINT8_C(5)
#define BMI160_FIFO_FULL_INT_PIN1_MSK           UINT8_C(0x20)
#define BMI160_FIFO_FULL_INT_PIN2_POS           UINT8_C(1)
#define BMI160_FIFO_FULL_INT_PIN2_MSK           UINT8_C(0x02)

#define BMI160_FIFO_WTM_INT_PIN1_POS             UINT8_C(6)
#define BMI160_FIFO_WTM_INT_PIN1_MSK             UINT8_C(0x40)
#define BMI160_FIFO_WTM_INT_PIN2_POS             UINT8_C(2)
#define BMI160_FIFO_WTM_INT_PIN2_MSK             UINT8_C(0x04)



#define BMI160_MANUAL_MODE_EN_POS                UINT8_C(7)
#define BMI160_MANUAL_MODE_EN_MSK               UINT8_C(0x80)
#define BMI160_AUX_READ_BURST_POS                UINT8_C(0)
#define BMI160_AUX_READ_BURST_MSK               UINT8_C(0x03)

