saitez/Cypress_wifi_ble-psoc62-/tez_bmi160_defs.h
#define BMI160_GYRO_SELF_TEST_EN_POS             UINT8_C(4)
#define BMI160_GYRO_SELF_TEST_EN_MSK            UINT8_C(0x10)
#define BMI160_GYRO_SELF_TEST_STATUS_POS         UINT8_C(1)
#define BMI160_GYRO_SELF_TEST_STATUS_POS_MSK    UINT8_C(0x02)

#define BMI160_GYRO_FOC_EN_POS                   UINT8_C(6)
#define BMI160_GYRO_FOC_EN_POS_MSK              UINT8_C(0x40)


#define BMI160_ACCEL_FOC_X_CONF_POS                    UINT8_C(4)
#define BMI160_ACCEL_FOC_X_CONF_POS_MSK               UINT8_C(0x30)

#define BMI160_ACCEL_FOC_Y_CONF_POS                    UINT8_C(2)
#define BMI160_ACCEL_FOC_Y_CONF_MSK                   UINT8_C(0x0C)

#define BMI160_ACCEL_FOC_Z_CONF_MSK                   UINT8_C(0x03)


#define BMI160_FOC_STATUS_POS                          UINT8_C(3)
#define BMI160_FOC_STATUS_MSK                          UINT8_C(0x08)


#define BMI160_GYRO_OFFSET_X_MSK                         UINT8_C(0x03)

#define BMI160_GYRO_OFFSET_Y_POS                         UINT8_C(0x02)
#define BMI160_GYRO_OFFSET_Y_MSK                          UINT8_C(0x0C)

#define BMI160_GYRO_OFFSET_Z_POS                          UINT8_C(4)
#define BMI160_GYRO_OFFSET_Z_MSK                          UINT8_C(0x30)

#define BMI160_ACCEL_OFFSET_EN_POS                          UINT8_C(6)
#define BMI160_ACCEL_OFFSET_EN_MSK                          UINT8_C(0x40)

#define BMI160_GYRO_OFFSET_EN_POS                          UINT8_C(7)
#define BMI160_GYRO_OFFSET_EN_MSK                          UINT8_C(0x80)


#define BMI160_GYRO_OFFSET_POS                              UINT8_C(8)
#define BMI160_GYRO_OFFSET_MSK                              UINT8_C(0x0300)

#define BMI160_NVM_UPDATE_POS                                UINT8_C(1)
#define BMI160_NVM_UPDATE_MSK                                UINT8_C(0x02)

#define BMI160_NVM_STATUS_POS                                UINT8_C(4)
#define BMI160_NVM_STATUS_MSK                                UINT8_C(0x10)


#define BMI160_MAG_POWER_MODE_MSK                          UINT8_C(0X03)

#define BMI160_ACCEL_POWER_MODE_MSK                        UINT8_C(0x30)
#define BMI160_ACCEL_POWER_MODE_POS                        UINT8_C(4)

#define BMI160_GYRO_POWER_MODE_MSK                         UINT8_C(0x0C)
#define BMI160_GYRO_POWER_MODE_POS                          UINT8_C(2)


//The ## provides a way to concatenate actual arguments during macro expansion.
// If a parameter in the replacement text is adjacent to a ##, the parameter is replaced by the actual argument, 
//the ## and surrounding white space are removed, and the result is re-scanned.

//SET bits and GET bits 
#define BMI160_GET_BITS(regvar,bitname) \
                       ((regvar & bitname##_MSK) >> bitname##_POS)

#define BMI160_SET_BITS(regvar,bitname,val) \
                      (regvar & ~bitname##_MSK) | \
                      ((val << bitname##_POS) & bitname##_MSK))

#define BMI160_SET_BITS_POS_0(reg_data,bitname,data) \
                            (reg_data & ~(bitname##_MSK)) | \
                                 (data & bitname##_MSK))                        
             

#define BMI160_GET_BITS_POS_0(reg_data, bitname) (reg_data & (bitname##_MSK))


/**\name UTILITY MACROS */

#define BMI160_SET_LOW_BYTE                             UINT16_C(0x00FF)
#define BMI160_SET_HIGH_BYTE                            UINT16_C(0xFF00)

#define BMI160_GET_LSB(var)                            (uint8_t)(var & BMI160_SET_LOW_BYTE )  
#define BMI160_GET_MSB(var)                            (uint8_t)(var & BMI160_SET_HIGH_BYTE ) >> 8     

                    

                    
//type definitions

typedef int8_t (*bmi160_com_fptr_t)(uint8_t dev_addr, uint8_t reg_addr, uint8_t *data, uint16_t len);

typedef void (*bmi160_delay_fptr_t)(uint32_t period);

//Data structures
// power management status

struct bmi160_pmu_status
{



 uint8_t accel_pmu_status;
  
 uint8_t gyro_pmu_status;
 
 uint8_t aux_pmu_status;
};

enum bmi160_int_status_sel{
       BMI160_INT_STATUS_0 = 1,
       BMI160_INT_STATUS_1 = 2,
       BMI160_INT_STATUS_2 = 4,
       BMI160_INT_STATUS_3 = 8,
       BMI160_INT_STATUS_ALL = 15,
};

//* @brief bmi160 interrupt status bits structure

struct bmi160_int_status_bits
{

uint32_t step                     : 1
uint32_t sigmot                   : 1
uint32_t anym                     : 1
uint32_t pmu_trigger_reserved     : 1
uint32_t d_tap                    : 1
uint32_t s_tap                    : 1
uint32_t orient                   : 1
uint32_t flat_int                 : 1

uint32_t reserved                 : 2 
uint32_t high_g                   : 1
uint32_t low_g                    : 1
uint32_t drdy                     : 1
uint32_t ff_full                  : 1
uint32_t fwm                      : 1
uint32_t no_mo                    : 1

uint32_t anym_first_x             : 1
uint32_t anym_first_y             : 1
uint32_t anym_first_z             : 1
uint32_t anym_sign                : 1
uint32_t tap_first_x              : 1
uint32_t tap_first_y              : 1
uint32_t tap_first_z              : 1
uint32_t tap_sign                 : 1

uint32_t high_first_x             : 1
uint32_t high_first_y             : 1
uint32_t high_first_z             : 1
uint32_t high_sign                : 1
uint32_t orient_1_0               : 2
uint32_t orient_2                 : 2
uint32_t flat                     : 1

};


 //@brief bmi160 interrupt status structure

union bmi160_int_status
{
  uint8_t data[4];
  bmi160_int_status_bits bit;
};

//  * @brief bmi160 sensor data structure which comprises of accel data
struct bmi160_sensor_data
{
  int16_t x;
  int16_t y;
  int16_t z;
  
 uint32_t sensortime;

};

//bmi160 aux data structure

struct bmi160_aux_data
{
   uint8_t data[8];
};


// * @brief bmi160 FOC configuration structure

struct bmi160_foc_conf
{

  uint8_t foc_gyr_en;
 
