saitez/Cypress_wifi_ble-psoc62-/tez_bmi160_defs.h
  uint8_t foc_acc_x;

  uint8_t foc_acc_y;

  uint8_t foc_acc_z;

  uint8_t acc_off_en;

  uint8_t gyro_off_en;

};

struct bmi160_offsets
{

int8_t off_acc_x;
 
int8_t off_acc_y;

int8_t off_acc_z;

int16_t off_gyro_x;

int16_t off_gyro_y;

int16_t off_gyro_z;


};



//` * @brief FIFO aux. sensor data structure


struct bmi160_aux_fifo_data
{

 uint8_t aux_x_lsb;

 uint8_t aux_x_msb;
 
 uint8_t aux_y_lsb;

 uint8_t aux_y_msb;

 uint8_t aux_z_lsb;

 uint8_t aux_z_msb;

 uint8_t aux_r_y2_lsb;

 uint8_t aux_r_y2_msb;

};

// BMI160 SENSOR SELECT STRUCTURE

enum bmi160_select_sensor {

   BMI160_ACCEL_ONLY = 1,
   BMI160_GYRO_ONLY,
   BMI160_BOTH_ACCEL_AND_GYRO

};


//* @brief bmi160 sensor step detector mode structure

enum bmi160_step_detect_mode {
  
   BMI160_STEP_DETECT_NORMAL,
   BMI160_STEP_DETECT_SENSITIVE,
   BMI160_STEP_DETECT_ROBUST,
   //non recomended user define settings
   BMI160_STEP_DETECT_USER_DEFINE
};


//* @brief enum for auxiliary burst read selection

enum bmi160_aux_read_len {
    
     BMI160_AUX_READ_LEN_0, 
    
     BMI160_AUX_READ_LEN_1 ,

     BMI160_AUX_READ_LEN_2 ,
 
     BMI160_AUX_READ_LEN_3 

    
};


//* @brief bmi160 sensor configuration structure

 struct bmi160_sensor_cfg {

//power configuration
        uint8_t power;
//output data register
        uint8_t odr;
 //range of the sensor data
       uint8_t range;
 // bandwidth of the sensor 
       uint8_t bw;

};

//* @brief Aux sensor configuration structure

struct bmi160_aux_cfg
{
      
      uint8_t  aux_sensor_enable   : 1 ;
      uint8_t  manual_enable       : 1 ;
      uint8_t  aux_rd_burst_len    : 2 ;
      uint8_t  aux_odr             : 4 ;
      uint8_t aux_i2c_addr;
};


//* @brief bmi160 interrupt channel selection structure

enum bmi160_int_channel {

      BMI160_INT_CHANNEL_NONE,
  
      BMI160_INT_CHANNEL_1,
 
      BMI160_INT_CHANNEL_2,
 
      BMI160_INT_CHANNEL_BOTH

};

enum bmi160_int_types {

       
      BMI160_ACC_ANY_MOTION_INT,

      BMI160_ACC_SIG_MOTION_INT,

      BMI160_STEP_DETECT_INT,
     
      BMI160_ACC_DOUBLE_TAP_INT,
 
      BMI160_ACC_SINGLE_TAP_INT,

      BMI160_ACC_ORIENT_INT,
   
      BMI160_ACC_FLAT_INT,

      BMI160_ACC_HIGH_G_INT,

      BMI160_ACC_LOW_G_INT,

      BMI160_ACC_SLOW_NO_MOTION_INT,

      BMI160_ACC_GYRO_DATA_RDY_INT,

      BMI160_ACC_GYRO_FIFO_FULL_INT,

      BMI160_ACC_GYRO_FIFO_WATERMARK_INT,

      BMI160_ACC_FIFO_TAG_INT_PIN

};


enum bmi160_any_sig_motion_active_interrupt_state
{

   BMI160_BOTH_ANY_SIG_MOTION_DSIABLED = -1,
  
   BMI160_ANY_MOTION_ENABLED,
 
   BMI160_SIG_MOTION_ENABLED
};



struct bmi160_acc_tap_int_cfg
{

   uint16_t  tap_thr     : 5;
   
   uint16_t tap_shock    : 1;

   uint16_t tap_quiet    : 1;
 
   uint16_t tap_dur      : 3;

   uint16_t tap_data_src  : 1;

  uint16_t tap_en         : 1;
 
  

};


 struct bmi160_acc_any_mot_int_cfg
{

 uint8_t anymotion_en       : 1;

 uint8_t anymotion_x        : 1;

 uint8_t anymotion_y        : 1;

 uint8_t anymotion_z        : 1;

 uint8_t anymotion_dur      : 2;
 
 uint8_t anymotion_data_src : 1;

 uint8_t anymotion_thr;

};


struct bmi160_acc_sig_mot_int_cfg
{

  uint8_t sig_mot_skip   : 2 ;
 
  uint8_t sig_mot_proof  : 2 ;

  uint8_t sig_data_src   : 1 ;

  uint8_t sig_en         : 1 ;

  uint8_t sig_mot_thres  : 1 ;

};


struct bmi160_acc_step_detect_int_cfg
{

  uint16_t step_detector_en    : 1 ;

  uint16_t min_threshold       : 2 ;

  uint16_t steptime_min        : 3 ;

  uint16_t step_detector_mode  : 2 ;

  uint16_t step_min_buf        : 3 ;

};


struct bmi160_acc_no_motion_int_cfg 
{

  uint16_t no_motion_x    : 1 ;

  uint16_t no_motion_y    : 1 ;

  uint16_t no_motion_z    : 1 ;

  uint16_t no_motion_dur  : 6 ;

  uint16_t no_motion_sel  : 1 ;

  uint16_t no_motion_src  : 1 ;

  uint8_t  no_motion_thres;


};


struct bmi160_acc_orient_int_cfg
{
   
 uint16_t orient_mode      : 2 ;

 uint16_t orient_blocking  : 2 ;

 uint16_t orient_hyst      : 4 ;

 uint16_t orient_theta     : 6 ;
 
 uint16_t orient_ud_en     : 1 ;

 uint16_t axes_ex          : 1 ;

 uint8_t orient_en         : 1 ;

};


struct bmi160_acc_flat_detect_int_cfg

{

  uint16_t flat_theta      : 6 ;
  
  uint16_t flat_hy         : 3 ;

  uint16_t flat_hold_time  : 2 ;

  uint16_t flat_en         : 1 ;

};

struct bmi160_acc_low_g_int_cfg

{
  
 uint8_t low_dur ;

 uint8_t low_thres ;

 uint8_t low_hyst      : 2 ;

 uint8_t low_mode      : 1 ;

 uint8_t low_data_src  : 1 ;

 uint8_t low_en        : 1  ;

};

 
 
 struct bmi160_acc_high_g_int_cfg
{

  
     uint8_t high_g_x       : 1 ;

     uint8_t high_g_y       : 1 ;
    
     uint8_t high_g_z       : 1 ;

     uint8_t high_hy        : 2 ;

     uint8_t high_data_src  : 1 ;

     uint8_t high_thres ;

     uint8_t high_dur ;
      
 };

struct bmi160_int_pin_settg
{

   uint16_t output_en   : 1 ;
   
   uint16_t output_mode  : 1 ;

   uint16_t output_type   : 1 ;

   uint16_t edge_ctrl : 1;

   uint16_t input_en : 1;

   uint16_t latch_dur : 4;

};


union bmi160_int_type_cfg
{

   struct bmi160_acc_tap_int_cfg acc_tap_int ;

   struct bmi160_acc_any_mot_int_cfg acc_any_motion_int;
  
    struct bmi160_acc_sig_mot_int_cfg acc_sig_motion_int;

    struct bmi160_acc_step_detect_int_cfg acc_step_detect_int;

     struct bmi160_acc_no_motion_int_cfg acc_no_motion_int;

       struct bmi160_acc_orient_int_cfg acc_orient_int;
    
       struct bmi160_acc_flat_detect_int_cfg acc_flat_int;
    
       struct bmi160_acc_low_g_int_cfg acc_low_g_int;

       struct bmi160_acc_high_g_int_cfg acc_high_g_int;


};



struct bmi160_int_settg
{

  enum bmi160_int_channel int_channel;
  
  enum bmi160_int_types int_type;

  struct bmi160_int_pin_settg int_pin_settg;

   union bmi160_int_type_cfg int_type_cfg;
 
    uint8_t fifo_full_int_en : 1;

     uint8_t fifo_wtm_int_en : 1;

};



struct bmi160_fifo_frame
{
   uint8_t *data;

   uint16_t length;

   uint8_t fifo_time_enable;

   uint8_t fifo_header_enable;
   
    uint8_t fifo_data_enable;

  
    uint16_t accel_byte_start_idx;

    
    uint16_t gyro_byte_start_idx;

   
    uint16_t aux_byte_start_idx;

  
    uint32_t sensor_time;

  
    uint8_t skipped_frame_count;
};
   
   
   
struct bmi160_dev
{

  uint8_t chip_id;
  
  uint8_t id;
 
  uint8_t interface;

  enum bmi160_any_sig_motion_active_interrupt_state any_sig_sel;

  struct bmi160_cfg accel_cfg;
  
  struct bmi160_cfg prev_accel_cfg;

  struct bmi160_cfg gyro_cfg;

  struct bmi160_aux_cfg aux_cfg;

  struct bmi160_aux_cfg prev_aux_cfg;

  struct bmi160_fifo_frame *fifo;

  bmi160_com_fptr_t read;

  bmi160_com_fptr_t write;

  bmi160_delay_fptr_t delay_ms;

  uint16_t read_write_len;

  uint8_t dummy_byte;
};

#endif


























       






































                    
